Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
data = [4,8,15,16,23,42]

In [3]:
data

[4, 8, 15, 16, 23, 42]

In [4]:
series = pd.Series(data)

In [5]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas. Series function on the variable print it.

In [7]:
data1 = [1,2,3,4,5,6,7,8,9,10]
series1 = pd.Series(data1)

In [8]:
series1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Name:
Alice,
Bob,
Claire

Age:
25,
30,
27

Gender:
Female,
Male,
Female

In [10]:
data2 = {'Name': ['Alice', 'Bob', 'Claire'],
         'Age': [25, 30, 27],
         'Gender': ['Female', 'Male', 'Female']}

In [11]:
df = pd.DataFrame(data2)

In [12]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional tabular data structure that consists of rows and columns, similar to a spreadsheet or a SQL table. It is a collection of one or more Pandas Series objects, where each column represents a series of data, and the rows contain the observations or records.

On the other hand, a Pandas Series is a one-dimensional labeled array that can hold any data type, such as integers, strings, or floating-point numbers. A DataFrame can be thought of as a collection of Pandas Series objects that share the same index, with each column representing a different variable, and each row representing a different observation or data point.

In [13]:
# Creating a Pandas Series
series2 = pd.Series([10, 20, 30, 40])

# Creating a Pandas DataFrame
df1 = pd.DataFrame({
    'A': [10, 20, 30, 40],
    'B': ['chandan', 'aayush', 'rohit', 'ravinder'],
})

In [14]:
series2

0    10
1    20
2    30
3    40
dtype: int64

In [15]:
df1

    A         B
0  10   chandan
1  20    aayush
2  30     rohit
3  40  ravinder

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [31]:
data3 = {'Name': ['Chandan', 'ravinder', 'aayush', 'jaan', 'rahul'],
        'Age': [25, 30, 27, 22, 28],
        'Gender': ['Female', 'Male', 'Female', 'Male', 'Female'],
        'Salary': [50000, 60000, 55000, 45000, 65000]}

In [32]:
df2 = pd.DataFrame(data3)
grp1 = df2.groupby('Gender')
average_salary = grp1['Salary'].mean()

In [33]:
average_salary

Gender
Female    56666.666667
Male      52500.000000
Name: Salary, dtype: float64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All Pandas data structures are value mutable (can be changed) and except Series all are size mutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [36]:
# Create Series for Name, Age, and Gender
names = pd.Series(['Chandan', 'ravinder', 'aayush'])
ages = pd.Series([25, 30, 27])
genders = pd.Series(['Female', 'Male', 'Female'])

# Concatenate the Series into a DataFrame
df3 = pd.concat([names, ages, genders], axis=1)
df3.columns = ['Name', 'Age', 'Gender']

In [37]:
df3

       Name  Age  Gender
0   Chandan   25  Female
1  ravinder   30    Male
2    aayush   27  Female